---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.NotAllowedToModifyGroupElementsWarning
source: html/1555348f-d2d7-b924-34a2-a1df822096c8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.NotAllowedToModifyGroupElementsWarning Property

Connection to a group failed. Modification of elements within a group is not allowed.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotAllowedToModifyGroupElementsWarning { get; }
```